## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 4 to change, 0 to destroy
```
**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/security-tools/actions/runs/4515323562).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.asset_inventory_cartography_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_inventory_cartography_state_machine"  {
      ~ id      = "1790038466" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:2",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:8",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.cartography_task_execution_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_task_execution_policies"  {
      ~ id      = "3044901198" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::946524763117:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::886481071419:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::866996500832:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::862524432354:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::847097524271:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806721586252:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::796730610681:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::774443804833:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::692499439251:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::659087519042:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::639515743091:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::571510889204:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::493890668711:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472285538301:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::419291849580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::373750682134:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::274536870005:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::226270273618:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::154232573588:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::137554749751:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::132761243856:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::131154131660:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::127893201980:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::067823670710:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::034163289675:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::026142063939:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::017790921725:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::008792007042:role/secopsAssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      + statement {
          + actions   = [
              + "organizations:ListAccounts",
              + "organizations:ListAccountsForParent",
              + "organizations:ListChildren",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:ListMultipartUploadParts",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.template_file.asset_inventory_cloudquery_state_machine will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "asset_inventory_cloudquery_state_machine"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + Comment        = "Run daily asset inventory of cloud assets"
              + StartAt        = "CloudQuery"
              + States         = {
                  + CloudQuery       = {
                      + Catch      = [
                          + {
                              + ErrorEquals = [
                                  + "States.ALL",
                                ]
                              + Next        = "Handle Failure"
                              + ResultPath  = null
                            },
                        ]
                      + End        = true
                      + Parameters = {
                          + Cluster              = "${CLOUDQUERY_CLUSTER}"
                          + LaunchType           = "FARGATE"
                          + NetworkConfiguration = {
                              + AwsvpcConfiguration = {
                                  + SecurityGroups = [
                                      + "${SECURITY_GROUPS}",
                                    ]
                                  + Subnets        = [
                                      + "${SUBNETS}",
                                    ]
                                }
                            }
                          + Overrides            = {
                              + ContainerOverrides = [
                                  + {
                                      + Environment = [
                                          + {
                                              + Name  = "CQ_S3_BUCKET"
                                              + Value = "${CLOUDQUERY_S3_BUCKET}"
                                            },
                                        ]
                                      + Name        = "${CLOUDQUERY_SERVICE_NAME}"
                                    },
                                ]
                            }
                          + TaskDefinition       = "${CLOUDQUERY_TASK_DEF}"
                        }
                      + Resource   = "arn:aws:states:::ecs:runTask"
                      + Retry      = [
                          + {
                              + BackoffRate     = 2
                              + ErrorEquals     = [
                                  + "ECS.AmazonECSException",
                                ]
                              + IntervalSeconds = 300
                              + MaxAttempts     = 4
                            },
                        ]
                      + Type       = "Task"
                    }
                  + "Handle Failure" = {
                      + End  = true
                      + Type = "Pass"
                    }
                }
              + TimeoutSeconds = 86400
            }
        )
      + vars     = {
          + "CLOUDQUERY_CLUSTER"      = "arn:aws:ecs:ca-central-1:794722365809:cluster/cloud_asset_discovery"
          + "CLOUDQUERY_S3_BUCKET"    = (known after apply)
          + "CLOUDQUERY_SERVICE_NAME" = "cloudquery"
          + "CLOUDQUERY_TASK_DEF"     = (known after apply)
          + "SECURITY_GROUPS"         = "sg-03caf974f268a3efb"
          + "SUBNETS"                 = "\"subnet-08cab5daf34489c53\", \"subnet-07f8e17bbf11b0797\", \"subnet-0d92713028fd15243\""
        }
    }

  # data.template_file.cloudquery_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cloudquery_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "CQ_S3_BUCKET"
                          + value = "${CQ_S3_BUCKET}"
                        },
                    ]
                  + essential        = true
                  + image            = "${CLOUDQUERY_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "${CLOUDQUERY_SERVICE_NAME}"
                  + portMappings     = []
                  + secrets          = []
                },
            ]
        )
      + vars     = {
          + "AWS_LOGS_GROUP"          = "/aws/ecs/cloudquery"
          + "AWS_LOGS_REGION"         = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"  = "cloudquery-task"
          + "CLOUDQUERY_IMAGE"        = (known after apply)
          + "CLOUDQUERY_SERVICE_NAME" = "cloudquery"
          + "CQ_S3_BUCKET"            = (known after apply)
          + "NEO4J_SECRETS_PASSWORD"  = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password"
        }
    }

  # aws_cloudwatch_event_rule.asset_inventory_cloudquery will be created
  + resource "aws_cloudwatch_event_rule" "asset_inventory_cloudquery" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "cloudquery"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 21 * * ? *)"
      + tags                = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.sfn_events_cloudquery will be created
  + resource "aws_cloudwatch_event_target" "sfn_events_cloudquery" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::794722365809:role/secopsAssetInventoryStateMachineRole"
      + rule           = "cloudquery"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.cloudquery will be created
  + resource "aws_cloudwatch_log_group" "cloudquery" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/ecs/cloudquery"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
    }

  # aws_ecr_repository.cloudquery will be created
  + resource "aws_ecr_repository" "cloudquery" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "security-tools/cloud_asset_inventory/cloudquery"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools"
          + "Terraform"  = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_task_definition.cloudquery will be created
  + resource "aws_ecs_task_definition" "cloudquery" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "4096"
      + execution_role_arn       = "arn:aws:iam::794722365809:role/cartography_container_execution_role"
      + family                   = "cloudquery"
      + id                       = (known after apply)
      + memory                   = "8192"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole"
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be updated in-place
  ~ resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
        id        = "arn:aws:iam::794722365809:policy/CartographyStateMachineECS"
        name      = "CartographyStateMachineECS"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PassRole",
                          - "iam:GetRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole",
                          - "arn:aws:iam::794722365809:role/cartography_container_execution_role",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:794722365809:stateMachine:asset-inventory-cartography"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:ListTasks"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ecs:RunTask"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder:2",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/sentinel_neo4j_forwarder",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography:8",
                          - "arn:aws:ecs:ca-central-1:794722365809:task-definition/cartography",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:794722365809:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.cartography_task_execution_policies will be updated in-place
  ~ resource "aws_iam_policy" "cartography_task_execution_policies" {
        id        = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies"
        name      = "CartographyTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::957818836222:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::946524763117:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::886481071419:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::871282759583:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::866996500832:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::862524432354:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::847097524271:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::843973686572:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806721586252:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::806545929748:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::796730610681:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::794722365809:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::774443804833:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::773858180673:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::762579868088:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::729164266357:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::692499439251:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::687401027353:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::659087519042:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::639515743091:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::637287734259:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::571510889204:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::563894450011:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::507252742351:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::493890668711:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472286471787:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::472285538301:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::419291849580:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::414662622316:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::373750682134:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::339850311124:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::296255494825:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::283582579564:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::276192857112:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::274536870005:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::239043911459:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::236007890657:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::226270273618:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::154232573588:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::137554749751:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::132761243856:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::131154131660:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::127893201980:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::124044056575:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::067823670710:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::034163289675:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::026142063939:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::017790921725:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::009883649233:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:iam::008792007042:role/secopsAssetInventorySecurityAuditRole",
                          - "arn:aws:sts::794722365809:assumed-role/AWSReservedSSO_AWSAdministratorAccess_b6d6eefb49121fb1/guillaume.charest@cds-snc.ca",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "organizations:ListAccountsForParent",
                          - "organizations:ListAccounts",
                          - "organizations:ListChildren",
                        ]
                      -...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.list_accounts_in_org"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
